src/DataProcessors/ПоказНамеченныхСобытийПоПерсоналу/ПоказНамеченныхСобытийПоПерсоналу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПоказНамеченныхСобытийПоПерсоналу</name>
  <comment>(Общ)</comment>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>ФормироватьДокумент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеСобытие</name>
      <type>
        <types>EnumRef.НамеченныеСобытияПоПерсоналу</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаниматьСтавку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УправленческийУчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/НамеченныеСобытияПоПерсоналу/НамеченныеСобытияПоПерсоналу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НамеченныеСобытияПоПерсоналу</name>
  <comment>(Общ)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаниматьСтавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемоеСобытие</name>
    <type>
      <types>EnumRef.НамеченныеСобытияПоПерсоналу</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеРаботников/СостояниеРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРаботников</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРаботника</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗавершения</name>
    <type>
      <types>EnumRef.СостоянияРаботника</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеРаботниковНаИспытательномСроке/СостояниеРаботниковНаИспытательномСроке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРаботниковНаИспытательномСроке</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРаботникаНаИспытательномСроке</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеРаботниковОрганизаций/СостояниеРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРаботниковОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗавершения</name>
    <type>
      <types>EnumRef.СостоянияРаботникаОрганизации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыЗанятостиВОрганизации/ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыДоговоровСФизЛицами/ВидыДоговоровСФизЛицами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровСФизЛицами</name>
  <enumValues>
    <name>ТрудовойДоговор</name>
  </enumValues>
  <enumValues>
    <name>Подряда</name>
  </enumValues>
  <enumValues>
    <name>Авторский</name>
  </enumValues>
  <enumValues>
    <name>ДоговорУправленческий</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ПоказНамеченныхСобытийПоПерсоналу/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ

// Получаем актуальные намеченные кадровые изменения
//
// Параметры
//  ДатаНачала		– дата, начало периода, в котором 
//                 надо регистрировать изменения
//  ДатаОкончания	– дата, окончание этого периода
//
// Возвращаемое значение:
//  Таблица значений – список подходящих изменений, по 
// структуре соответствует табличной части обработки
//
Процедура Автозаполнение(МаксимальноеКоличествоСобытий = 0) Экспорт
	
	Результаты.Очистить();
	
	Выборка = СформироватьЗапрос(?(Организация.Пустая(), Неопределено, Организация), ДатаНачала, ДатаОкончания, МаксимальноеКоличествоСобытий).Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результаты.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // ВыбратьНамеченныеИзменения()

// Формирует текст запроса и исполняет его
//
// Параметры
//  ДатаНачала		– параметр запроса 
//  ДатаОкончания	– параметр запроса 
//
// Возвращаемое значение:
//  Результат выполнения запроса
//
Функция СформироватьЗапрос(Организации = Неопределено, ДатаНачала, ДатаОкончания, МаксимальноеКоличествоСобытий = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаНачала",		ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	Запрос.УстановитьПараметр("Организации",	Организации);

	СписокСотрудниковТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
	|	РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОкончания, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
	|ГДЕ
	|	РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОсновноеМесто.Сотрудник.Физлицо
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(РаботникиСовместительство.Сотрудник),
	|	РаботникиСовместительство.Сотрудник.Физлицо,
	|	2
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОкончания, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
	|ГДЕ
	|	РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиСовместительство.Сотрудник.Физлицо
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(СотрудникиДУ.Ссылка),
	|	СотрудникиДУ.Физлицо,
	|	ВЫБОР
	|		КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
	|			ТОГДА 3
	|		КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|			ТОГДА 4
	|		ИНАЧЕ 5
	|	КОНЕЦ
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиДУ.Физлицо,
	|	ВЫБОР
	|		КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
	|			ТОГДА 3
	|		КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|			ТОГДА 4
	|		ИНАЧЕ 5
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Приоритет";
	
	Запрос.Текст = СписокСотрудниковТекст;
	Запрос.Выполнить();
	СписокСотрудниковТекст = "ВТСписокСотрудников";
	
	СписокФизическихЛицТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизическихЛиц.Физлицо КАК Физлицо,
	|	МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТСписокФизическихЛиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
	|		1 КАК Приоритет
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОкончания, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
	|	ГДЕ
	|		РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		РаботникиСовместительство.Сотрудник.Физлицо,
	|		2
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОкончания, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
	|	ГДЕ
	|		РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		СотрудникиДУ.Физлицо,
	|		ВЫБОР
	|			КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
	|				ТОГДА 3
	|			КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|				ТОГДА 4
	|			ИНАЧЕ 5
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизическихЛиц.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Приоритет";
	Запрос.Текст = СписокФизическихЛицТекст;
	Запрос.Выполнить();
	СписокФизическихЛицТекст = "ВТСписокФизическихЛиц";
	
	Запрос.Текст =
	"ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	Сотрудники.Сотрудник,
	|	НамеченныеИзменения.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	НамеченныеИзменения.Подразделение,
	|	НамеченныеИзменения.Должность,
	|	НамеченныеИзменения.ЗанимаемыхСтавок,
	|	NULL КАК ЗаниматьСтавку,
	|	НамеченныеИзменения.ГрафикРаботы КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	КОНЕЦ КАК Состояние,
	|	NULL КАК Организация,
	|	ИСТИНА КАК УправленческийУчет,
	|	Сотрудники.Сотрудник.Наименование,
	|	NULL КАК ОрганизацияНаименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(Работники.Период) КАК ДатаЗначения,
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо КАК Физлицо,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.Подразделение КАК Подразделение,
	|		НамеченныеСобытияПоПерсоналу.Должность КАК Должность,
	|		НамеченныеСобытияПоПерсоналу.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|		НамеченныеСобытияПоПерсоналу.ГрафикРаботы КАК ГрафикРаботы
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|			ПО НамеченныеСобытияПоПерсоналу.ДатаИзменения >= Работники.Период
	|				И НамеченныеСобытияПоПерсоналу.ФизЛицо = Работники.ФизЛицо
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие = ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)
	|		И НамеченныеСобытияПоПерсоналу.ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ Физлицо ИЗ ВТСписокФизическихЛиц)";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.Подразделение,
	|		НамеченныеСобытияПоПерсоналу.Должность,
	|		НамеченныеСобытияПоПерсоналу.ЗанимаемыхСтавок,
	|		НамеченныеСобытияПоПерсоналу.ГрафикРаботы,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|		ПО НамеченныеИзменения.ДатаЗначения = Работники.Период
	|			И НамеченныеИзменения.Физлицо = Работники.ФизЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписокСотрудников.Сотрудник КАК Сотрудник,
	|			СписокСотрудников.Физлицо КАК Физлицо
	|		ИЗ
	|			" + СписокСотрудниковТекст + " КАК СписокСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокФизическихЛицТекст + " КАК СписокФизическихЛиц
	|			ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
	|				И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
	|		ПО НамеченныеИзменения.Физлицо = Сотрудники.Физлицо
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				ТОГДА ИСТИНА
	|			КОГДА НамеченныеИзменения.ПланируемоеСобытие = ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)
	|				ТОГДА ВЫБОР
	|						КОГДА НамеченныеИзменения.Подразделение = Работники.Подразделение
	|								И НамеченныеИзменения.Должность = Работники.Должность
	|								И НамеченныеИзменения.ЗанимаемыхСтавок = Работники.ЗанимаемыхСтавок
	|								И НамеченныеИзменения.ГрафикРаботы = Работники.ГрафикРаботы
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	Сотрудники.Сотрудник,
	|	НамеченныеИзменения.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НамеченныеИзменения.ЗаниматьСтавку,
	|	NULL,
	|	СостояниеРаботников.Состояние,
	|	NULL,
	|	ИСТИНА,
	|	Сотрудники.Сотрудник.Наименование,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(СостояниеРаботников.Период) КАК ДатаЗначения,
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо КАК Физлицо,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ЗаниматьСтавку КАК ЗаниматьСтавку
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников КАК СостояниеРаботников
	|			ПО НамеченныеСобытияПоПерсоналу.ДатаИзменения >= СостояниеРаботников.Период
	|				И НамеченныеСобытияПоПерсоналу.ФизЛицо = СостояниеРаботников.ФизЛицо
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Командировка), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускБезСохраненияЗарплаты), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускЕжегодный), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускПоУходуЗаРебенком), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускУчебный))
	|		И НамеченныеСобытияПоПерсоналу.ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ Физлицо ИЗ ВТСписокФизическихЛиц)";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ЗаниматьСтавку,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СостояниеРаботников.ФизЛицо КАК Физлицо,
	|			СостояниеРаботников.Период КАК Период,
	|			СостояниеРаботников.Состояние КАК Состояние
	|		ИЗ
	|			РегистрСведений.СостояниеРаботников КАК СостояниеРаботников";
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|			ГДЕ
	|				СостояниеРаботников.Период <= &ДатаОкончания";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			СостояниеРаботников.ФизЛицо,
	|			СостояниеРаботников.ПериодЗавершения,
	|			СостояниеРаботников.СостояниеЗавершения
	|		ИЗ
	|			РегистрСведений.СостояниеРаботников КАК СостояниеРаботников
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников КАК СостояниеРаботниковПроверка
	|				ПО СостояниеРаботников.ФизЛицо = СостояниеРаботниковПроверка.ФизЛицо
	|					И СостояниеРаботниковПроверка.Период > СостояниеРаботников.Период
	|					И СостояниеРаботниковПроверка.Период <= СостояниеРаботников.ПериодЗавершения
	|		ГДЕ
	|			СостояниеРаботниковПроверка.ФизЛицо ЕСТЬ NULL 
	|			И СостояниеРаботников.Период <= &ДатаОкончания) КАК СостояниеРаботников
	|		ПО НамеченныеИзменения.ДатаЗначения = СостояниеРаботников.Период
	|			И НамеченныеИзменения.Физлицо = СостояниеРаботников.Физлицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписокСотрудников.Сотрудник КАК Сотрудник,
	|			СписокСотрудников.Физлицо КАК Физлицо
	|		ИЗ
	|			" + СписокСотрудниковТекст + " КАК СписокСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокФизическихЛицТекст + " КАК СписокФизическихЛиц
	|			ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
	|				И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
	|		ПО НамеченныеИзменения.Физлицо = Сотрудники.Физлицо
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Командировка)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускЕжегодный)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускУчебный)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускПоУходуЗаРебенком)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускБезСохраненияЗарплаты)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|					И (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботников.Состояние ЕСТЬ NULL 
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	Сотрудники.Сотрудник,
	|	НамеченныеИзменения.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	КОНЕЦ,
	|	NULL,
	|	ИСТИНА,
	|	Сотрудники.Сотрудник.Наименование,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо КАК Физлицо,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		МАКСИМУМ(Работники.Период) КАК ДатаЗначения
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|			ПО (ДОБАВИТЬКДАТЕ(НамеченныеСобытияПоПерсоналу.ДатаИзменения, ДЕНЬ, 1) >= Работники.Период)
	|				И НамеченныеСобытияПоПерсоналу.ФизЛицо = Работники.ФизЛицо
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока))
	|		И НамеченныеСобытияПоПерсоналу.ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ Физлицо ИЗ ВТСписокФизическихЛиц)";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|		ПО НамеченныеИзменения.ДатаЗначения = Работники.Период
	|			И НамеченныеИзменения.Физлицо = Работники.ФизЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписокСотрудников.Сотрудник КАК Сотрудник,
	|			СписокСотрудников.Физлицо КАК Физлицо
	|		ИЗ
	|			" + СписокСотрудниковТекст + " КАК СписокСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокФизическихЛицТекст + " КАК СписокФизическихЛиц
	|			ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
	|				И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
	|		ПО НамеченныеИзменения.Физлицо = Сотрудники.Физлицо
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	Сотрудники.Сотрудник,
	|	НамеченныеИзменения.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	КОНЕЦ,
	|	NULL,
	|	ИСТИНА,
	|	Сотрудники.Сотрудник.Наименование,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(НамеченныеСобытияПоПерсоналу.ДатаИзменения) КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо КАК Физлицо,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		МАКСИМУМ(Работники.Период) КАК ДатаЗначения
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|			ПО (ДОБАВИТЬКДАТЕ(НамеченныеСобытияПоПерсоналу.ДатаИзменения, ДЕНЬ, 1) >= Работники.Период)
	|				И НамеченныеСобытияПоПерсоналу.ФизЛицо = Работники.ФизЛицо
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие  = ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока)
	|		И НамеченныеСобытияПоПерсоналу.ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ Физлицо ИЗ ВТСписокФизическихЛиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ФизЛицо) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|		ПО НамеченныеИзменения.ДатаЗначения = Работники.Период
	|			И НамеченныеИзменения.Физлицо = Работники.ФизЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписокСотрудников.Сотрудник КАК Сотрудник,
	|			СписокСотрудников.Физлицо КАК Физлицо
	|		ИЗ
	|			" + СписокСотрудниковТекст + " КАК СписокСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокФизическихЛицТекст + " КАК СписокФизическихЛиц
	|			ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
	|				И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
	|		ПО НамеченныеИзменения.Физлицо = Сотрудники.Физлицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковНаИспытательномСроке.СрезПоследних(, ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ Физлицо ИЗ ВТСписокФизическихЛиц)) КАК СостояниеРаботниковНаИспытательномСроке
	|		ПО НамеченныеИзменения.Физлицо = СостояниеРаботниковНаИспытательномСроке.Физлицо
	|			И СостояниеРаботниковНаИспытательномСроке.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаНаИспытательномСроке.ПринятНаИспытательныйСрок)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ = ЛОЖЬ";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеИзменения.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеИзменения.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	НамеченныеИзменения.Сотрудник,
	|	НамеченныеИзменения.Сотрудник.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	НамеченныеИзменения.Подразделение,
	|	НамеченныеИзменения.Должность,
	|	НамеченныеИзменения.ЗанимаемыхСтавок,
	|	NULL,
	|	НамеченныеИзменения.ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	КОНЕЦ,
	|	НамеченныеИзменения.Организация,
	|	ЛОЖЬ,
	|	НамеченныеИзменения.Сотрудник.Наименование,
	|	НамеченныеИзменения.Организация.Наименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаЗначения,
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник КАК Сотрудник,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ПодразделениеОрганизации КАК Подразделение,
	|		НамеченныеСобытияПоПерсоналу.Должность КАК Должность,
	|		НамеченныеСобытияПоПерсоналу.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|		НамеченныеСобытияПоПерсоналу.ГрафикРаботы КАК ГрафикРаботы,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ КАК Организация
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО НамеченныеСобытияПоПерсоналу.ДатаИзменения >= РаботникиОрганизаций.Период
	|				И НамеченныеСобытияПоПерсоналу.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие = ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)
	|		И НамеченныеСобытияПоПерсоналу.Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ ВТСписокСотрудников)";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Если Организации <> Неопределено Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.Организация В(&Организации)
	|		И НамеченныеСобытияПоПерсоналу.ПодразделениеОрганизации.Владелец В(&Организации)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ПодразделениеОрганизации,
	|		НамеченныеСобытияПоПерсоналу.Должность,
	|		НамеченныеСобытияПоПерсоналу.ЗанимаемыхСтавок,
	|		НамеченныеСобытияПоПерсоналу.ГрафикРаботы,
	|		НамеченныеСобытияПоПерсоналу.Организация,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО НамеченныеИзменения.ДатаЗначения = РаботникиОрганизаций.Период
	|			И НамеченныеИзменения.Сотрудник = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НамеченныеИзменения.ПланируемоеСобытие = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				ТОГДА ИСТИНА
	|			КОГДА НамеченныеИзменения.ПланируемоеСобытие = ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)
	|				ТОГДА ВЫБОР
	|						КОГДА НамеченныеИзменения.Подразделение = РаботникиОрганизаций.ПодразделениеОрганизации
	|								И НамеченныеИзменения.Должность = РаботникиОрганизаций.Должность
	|								И НамеченныеИзменения.ЗанимаемыхСтавок = РаботникиОрганизаций.ЗанимаемыхСтавок
	|								И НамеченныеИзменения.ГрафикРаботы = РаботникиОрганизаций.ГрафикРаботы
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	НамеченныеИзменения.Сотрудник,
	|	НамеченныеИзменения.Сотрудник.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НамеченныеИзменения.ЗаниматьСтавку,
	|	NULL,
	|	СостояниеРаботниковОрганизации.Состояние,
	|	НамеченныеИзменения.Организация,
	|	ЛОЖЬ,
	|	НамеченныеИзменения.Сотрудник.Наименование,
	|	НамеченныеИзменения.Организация.Наименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(СостояниеРаботниковОрганизации.Период) КАК ДатаЗначения,
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник КАК Сотрудник,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ЗаниматьСтавку КАК ЗаниматьСтавку,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ КАК Организация
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизации
	|			ПО НамеченныеСобытияПоПерсоналу.ДатаИзменения >= СостояниеРаботниковОрганизации.Период
	|				И НамеченныеСобытияПоПерсоналу.Сотрудник = СостояниеРаботниковОрганизации.Сотрудник
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Командировка), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускБезСохраненияЗарплаты), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускЕжегодный), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускПоУходуЗаРебенком), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускУчебный))
	|		И НамеченныеСобытияПоПерсоналу.Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ ВТСписокСотрудников)";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Если Организации <> Неопределено Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.Организация В(&Организации)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.ЗаниматьСтавку,
	|		НамеченныеСобытияПоПерсоналу.Организация,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизации
	|		ПО НамеченныеИзменения.ДатаЗначения = СостояниеРаботниковОрганизации.Период
	|			И НамеченныеИзменения.Сотрудник = СостояниеРаботниковОрганизации.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Командировка)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускЕжегодный)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускУчебный)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускПоУходуЗаРебенком)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты)
	|					И НамеченныеИзменения.ПланируемоеСобытие <> ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.ОтпускБезСохраненияЗарплаты)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|					И (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|				ТОГДА ИСТИНА
	|			КОГДА СостояниеРаботниковОрганизации.Состояние ЕСТЬ NULL 
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	НамеченныеИзменения.Сотрудник,
	|	НамеченныеИзменения.Сотрудник.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	КОНЕЦ,
	|	НамеченныеИзменения.Организация,
	|	ЛОЖЬ,
	|	НамеченныеИзменения.Сотрудник.Наименование,
	|	НамеченныеИзменения.Организация.Наименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник КАК Сотрудник,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаЗначения,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ КАК Организация
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО (ДОБАВИТЬКДАТЕ(НамеченныеСобытияПоПерсоналу.ДатаИзменения, ДЕНЬ, 1) >= РаботникиОрганизаций.Период)
	|				И НамеченныеСобытияПоПерсоналу.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока))
	|		И НамеченныеСобытияПоПерсоналу.Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ ВТСписокСотрудников)";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	Если Организации <> Неопределено Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.Организация В(&Организации)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.Организация,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО НамеченныеИзменения.ДатаЗначения = РаботникиОрганизаций.Период
	|			И НамеченныеИзменения.Сотрудник = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий) + "
	|	НамеченныеИзменения.ДатаИзменения,
	|	НамеченныеИзменения.Сотрудник,
	|	НамеченныеИзменения.Сотрудник.Физлицо,
	|	НамеченныеИзменения.ПланируемоеСобытие,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеРаботает)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	КОНЕЦ,
	|	НамеченныеИзменения.Организация,
	|	ЛОЖЬ,
	|	НамеченныеИзменения.Сотрудник.Наименование,
	|	НамеченныеИзменения.Организация.Наименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(НамеченныеСобытияПоПерсоналу.ДатаИзменения) КАК ДатаИзменения,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник КАК Сотрудник,
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие КАК ПланируемоеСобытие,
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаЗначения,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ КАК Организация
	|	ИЗ
	|		РегистрСведений.НамеченныеСобытияПоПерсоналу КАК НамеченныеСобытияПоПерсоналу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО (ДОБАВИТЬКДАТЕ(НамеченныеСобытияПоПерсоналу.ДатаИзменения, ДЕНЬ, 1) >= РаботникиОрганизаций.Период)
	|				И НамеченныеСобытияПоПерсоналу.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	ГДЕ
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие = ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока)
	|		И НамеченныеСобытияПоПерсоналу.Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ ВТСписокСотрудников)";
	Если Организации <> Неопределено Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеСобытияПоПерсоналу.Организация В(&Организации)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НамеченныеСобытияПоПерсоналу.ПланируемоеСобытие,
	|		НамеченныеСобытияПоПерсоналу.Организация,
	|		ВЫБОР
	|			КОГДА НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА НамеченныеСобытияПоПерсоналу.Организация
	|			ИНАЧЕ НамеченныеСобытияПоПерсоналу.Организация.ГоловнаяОрганизация
	|		КОНЕЦ,
	|		НамеченныеСобытияПоПерсоналу.Сотрудник) КАК НамеченныеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО НамеченныеИзменения.ДатаЗначения = РаботникиОрганизаций.Период
	|			И НамеченныеИзменения.Сотрудник = РаботникиОрганизаций.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковНаИспытательномСроке.СрезПоследних(, ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ Физлицо ИЗ ВТСписокФизическихЛиц)) КАК СостояниеРаботниковНаИспытательномСроке
	|		ПО НамеченныеИзменения.Сотрудник.Физлицо = СостояниеРаботниковНаИспытательномСроке.Физлицо
	|			И СостояниеРаботниковНаИспытательномСроке.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаНаИспытательномСроке.ПринятНаИспытательныйСрок)
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//|				ТОГДА ИСТИНА
	////|			ИНАЧЕ ВЫБОР
	////|					КОГДА (НЕ НамеченныеИзменения.ПланируемоеСобытие В (ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Увольнение), ЗНАЧЕНИЕ(Перечисление.НамеченныеСобытияПоПерсоналу.Перемещение)))
	////|						ТОГДА ИСТИНА
	////|					ИНАЧЕ ЛОЖЬ
	////|				КОНЕЦ
	//|		КОНЕЦ = ЛОЖЬ
	|";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеИзменения.ДатаИзменения >= &ДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И НамеченныеИзменения.ДатаИзменения <= &ДатаОкончания";
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапрос()

// Разбирает отмеченные строки т.ч. обработки по видам намеченных кадровых изменений
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//	Таблица значений с описанием документов, которые следует создать
//
Функция РазобратьТаблицуИзменений() Экспорт
	Перем Док, ТЧ;
	
	СписокДокументов = Новый ТаблицаЗначений;
	СписокДокументов.Колонки.Добавить("ИмяДокумента");
	СписокДокументов.Колонки.Добавить("Организация");
	СписокДокументов.Колонки.Добавить("ИмяТЧ");
	СписокДокументов.Колонки.Добавить("ТЧ");
	
	СписокДокументов.Индексы.Добавить("ИмяДокумента");
	СписокДокументов.Индексы.Добавить("Организация");
	
	ПараметрыОтбора = Новый Структура;
	
	Для Каждого Строка Из Результаты Цикл
		Если Не Строка.ФормироватьДокумент Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.УправленческийУчет Тогда
			Если Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Увольнение 
			 ИЛИ Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока Тогда
				ПараметрыОтбора.Вставить("ИмяДокумента",	"Увольнение");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "Увольнение";
					Док.Организация		= Строка.Организация;
					Док.ИмяТЧ			= "Работники";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.Увольнение.ТабличныеЧасти.Работники.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник			= Строка.Сотрудник;
				СтрокаТаб.ДатаУвольнения	= Строка.ДатаИзменения;
				СтрокаТаб.ПричинаУвольнения	= Строка.ПланируемоеСобытие;
				
			ИначеЕсли Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение Тогда
				ПараметрыОтбора.Вставить("ИмяДокумента",	"КадровоеПеремещение");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "КадровоеПеремещение";
					Док.Организация		= Строка.Организация;
					Док.ИмяТЧ			= "Работники";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.КадровоеПеремещение.ТабличныеЧасти.Работники.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник				= Строка.Сотрудник;
				СтрокаТаб.ДатаНачала			= Строка.ДатаИзменения;
				СтрокаТаб.НовоеПодразделение	= Строка.Подразделение;
				СтрокаТаб.НоваяДолжность		= Строка.Должность;
				СтрокаТаб.ЗанимаемыхСтавок		= Строка.ЗанимаемыхСтавок;
				СтрокаТаб.ГрафикРаботы			= Строка.ГрафикРаботы;
				
			ИначеЕсли Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока Тогда
				ПараметрыОтбора.Вставить("ИмяДокумента",	"РезультатИспытательногоСрока");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "РезультатИспытательногоСрока";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.РезультатИспытательногоСрока.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник				= Строка.Сотрудник;
				СтрокаТаб.Физлицо				= Строка.Физлицо;
				СтрокаТаб.ДатаИзменения			= Строка.ДатаИзменения;
				СтрокаТаб.Результат				= Перечисления.РезультатыИспытательногоСрока.Положительный;
				
			Иначе
				ПараметрыОтбора.Вставить("ИмяДокумента",	"ВозвратНаРаботу");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "ВозвратНаРаботу";
					Док.Организация		= Строка.Организация;
					Док.ИмяТЧ			= "Работники";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.ВозвратНаРаботу.ТабличныеЧасти.Работники.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник			= Строка.Сотрудник;
				СтрокаТаб.ДатаВозврата		= Строка.ДатаИзменения;
				СтрокаТаб.ЗаниматьСтавку	= Строка.ЗаниматьСтавку;
				
			КонецЕсли;
			
		Иначе
			Если Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Увольнение 
			 ИЛИ Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока Тогда
				ПараметрыОтбора.Вставить("ИмяДокумента",	"УвольнениеИзОрганизаций");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "УвольнениеИзОрганизаций";
					Док.Организация		= Строка.Организация;
					Док.ИмяТЧ			= "РаботникиОрганизации";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.УвольнениеИзОрганизаций.ТабличныеЧасти.РаботникиОрганизации.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник			= Строка.Сотрудник;
				СтрокаТаб.Физлицо			= Строка.Физлицо;
				СтрокаТаб.ДатаУвольнения	= Строка.ДатаИзменения;
				
			ИначеЕсли Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение Тогда
				ПараметрыОтбора.Вставить("ИмяДокумента",	"КадровоеПеремещениеОрганизаций");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "КадровоеПеремещениеОрганизаций";
					Док.Организация		= Строка.Организация;
					Док.ИмяТЧ			= "РаботникиОрганизации";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.КадровоеПеремещениеОрганизаций.ТабличныеЧасти.РаботникиОрганизации.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник					= Строка.Сотрудник;
				СтрокаТаб.Физлицо					= Строка.Физлицо;
				СтрокаТаб.ДатаНачала				= Строка.ДатаИзменения;
				СтрокаТаб.ПодразделениеОрганизации	= Строка.Подразделение;
				СтрокаТаб.Должность					= Строка.Должность;
				СтрокаТаб.ГрафикРаботы				= Строка.ГрафикРаботы;
				СтрокаТаб.ЗанимаемыхСтавок			= Строка.ЗанимаемыхСтавок;
				
			ИначеЕсли Строка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока Тогда
				ПараметрыОтбора.Вставить("ИмяДокумента",	"РезультатИспытательногоСрока");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "РезультатИспытательногоСрока";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.РезультатИспытательногоСрока.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник				= Строка.Сотрудник;
				СтрокаТаб.Физлицо				= Строка.Физлицо;
				СтрокаТаб.ДатаИзменения			= Строка.ДатаИзменения;
				СтрокаТаб.Результат				= Перечисления.РезультатыИспытательногоСрока.Положительный;
				
			Иначе
				ПараметрыОтбора.Вставить("ИмяДокумента",	"ВозвратНаРаботуОрганизаций");
				ПараметрыОтбора.Вставить("Организация",		Строка.Организация);
				НайденныеСтроки = СписокДокументов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Док = СписокДокументов.Добавить();
					Док.ИмяДокумента	= "ВозвратНаРаботуОрганизаций";
					Док.Организация		= Строка.Организация;
					Док.ИмяТЧ			= "РаботникиОрганизации";
				Иначе
					Док = НайденныеСтроки[0];
				КонецЕсли;
					
				Если Док.ТЧ = Неопределено Тогда
					ТЧ = Новый ТаблицаЗначений;
					Для Каждого Реквизит Из Метаданные.Документы.ВозвратНаРаботуОрганизаций.ТабличныеЧасти.РаботникиОрганизации.Реквизиты Цикл
						ТЧ.Колонки.Добавить(Реквизит.Имя);
					КонецЦикла;
					Док.ТЧ = ТЧ;
				Иначе
					ТЧ = Док.ТЧ;
				КонецЕсли;
				
				СтрокаТаб = ТЧ.Добавить();
				СтрокаТаб.Сотрудник			= Строка.Сотрудник;
				СтрокаТаб.Физлицо			= Строка.Физлицо;
				СтрокаТаб.ДатаВозврата		= Строка.ДатаИзменения;
				СтрокаТаб.ЗаниматьСтавку	= Строка.ЗаниматьСтавку;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции
